lkolbly/cmsis-svd/data/TexasInstruments/LM3S2616.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>TIMER0</name>
      <description>Register map for TIMER0 peripheral</description>
      <groupName>TIMER</groupName>
      <prependToName>TIMER0</prependToName>
      <baseAddress>0x40030000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x00001000</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>CFG</name>
          <description>GPTM Configuration</description>
          <addressOffset>0x00000000</addressOffset>
          <fields>
            <field>
              <name>TIMER_CFG</name>
              <description>GPTM Configuration</description>
              <bitRange>[2:0]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TIMER_CFG_32_BIT_TIMER</name>
                  <description>32-bit timer configuration</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIMER_CFG_16_BIT</name>
                  <description>16-bit timer configuration. The function is controlled by bits 1:0 of GPTMTAMR and GPTMTBMR</description>
                  <value>0x4</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>TAMR</name>
          <description>GPTM Timer A Mode</description>
          <addressOffset>0x00000004</addressOffset>
          <fields>
            <field>
              <name>TIMER_TAMR_TAMR</name>
              <description>GPTM Timer A Mode</description>
              <bitRange>[1:0]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TIMER_TAMR_TAMR_1_SHOT</name>
                  <description>One-Shot Timer mode</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIMER_TAMR_TAMR_PERIOD</name>
                  <description>Periodic Timer mode</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>TBMR</name>
          <description>GPTM Timer B Mode</description>
          <addressOffset>0x00000008</addressOffset>
          <fields>
            <field>
              <name>TIMER_TBMR_TBMR</name>
              <description>GPTM Timer B Mode</description>
              <bitRange>[1:0]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TIMER_TBMR_TBMR_1_SHOT</name>
                  <description>One-Shot Timer mode</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIMER_TBMR_TBMR_PERIOD</name>
                  <description>Periodic Timer mode</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CTL</name>
          <description>GPTM Control</description>
          <addressOffset>0x0000000C</addressOffset>
          <fields>
            <field>
              <name>TIMER_CTL_TAEN</name>
              <description>GPTM Timer A Enable</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>TIMER_CTL_TASTALL</name>
              <description>GPTM Timer A Stall Enable</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>TIMER_CTL_TAOTE</name>
              <description>GPTM Timer A Output Trigger Enable</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>TIMER_CTL_TBEN</name>
              <description>GPTM Timer B Enable</description>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>TIMER_CTL_TBSTALL</name>
              <description>GPTM Timer B Stall Enable</description>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>TIMER_CTL_TBOTE</name>
              <description>GPTM Timer B Output Trigger Enable</description>
              <bitRange>[13:13]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IMR</name>
          <description>GPTM Interrupt Mask</description>
          <addressOffset>0x00000018</addressOffset>
          <fields>
            <field>
              <name>TIMER_IMR_TATOIM</name>
              <description>GPTM Timer A Time-Out Interrupt Mask</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>TIMER_IMR_TBTOIM</name>
              <description>GPTM Timer B Time-Out Interrupt Mask</description>
              <bitRange>[8:8]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RIS</name>
          <description>GPTM Raw Interrupt Status</description>
          <addressOffset>0x0000001C</addressOffset>
          <fields>
            <field>
              <name>TIMER_RIS_TATORIS</name>
              <description>GPTM Timer A Time-Out Raw Interrupt</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>TIMER_RIS_TBTORIS</name>
              <description>GPTM Timer B Time-Out Raw Interrupt</description>
              <bitRange>[8:8]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>MIS</name>
          <description>GPTM Masked Interrupt Status</description>
          <addressOffset>0x00000020</addressOffset>
          <fields>
            <field>
              <name>TIMER_MIS_TATOMIS</name>
              <description>GPTM Timer A Time-Out Masked Interrupt</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>TIMER_MIS_TBTOMIS</name>
              <description>GPTM Timer B Time-Out Masked Interrupt</description>
              <bitRange>[8:8]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ICR</name>
          <description>GPTM Interrupt Clear</description>
          <addressOffset>0x00000024</addressOffset>
          <access>write-only</access>
          <fields>
            <field>
              <name>TIMER_ICR_TATOCINT</name>
              <description>GPTM Timer A Time-Out Raw Interrupt</description>
              <bitRange>[0:0]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>TIMER_ICR_TBTOCINT</name>
              <description>GPTM Timer B Time-Out Interrupt Clear</description>
              <bitRange>[8:8]</bitRange>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TAILR</name>
          <description>GPTM Timer A Interval Load</description>
          <addressOffset>0x00000028</addressOffset>
          <fields>
            <field>
              <name>TIMER_TAILR_TAILRL</name>
              <description>GPTM Timer A Interval Load Register Low</description>
              <bitRange>[15:0]</bitRange>
            </field>
            <field>
              <name>TIMER_TAILR_TAILRH</name>
              <description>GPTM Timer A Interval Load Register High</description>
              <bitRange>[31:16]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TBILR</name>
          <description>GPTM Timer B Interval Load</description>
          <addressOffset>0x0000002C</addressOffset>
          <fields>
            <field>
              <name>TIMER_TBILR_TBILRL</name>
              <description>GPTM Timer B Interval Load Register</description>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TAPR</name>
          <description>GPTM Timer A Prescale</description>
          <addressOffset>0x00000038</addressOffset>
          <fields>
            <field>
              <name>TIMER_TAPR_TAPSR</name>
              <description>GPTM Timer A Prescale</description>
              <bitRange>[7:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TBPR</name>
          <description>GPTM Timer B Prescale</description>
          <addressOffset>0x0000003C</addressOffset>
          <fields>
            <field>
              <name>TIMER_TBPR_TBPSR</name>
              <description>GPTM Timer B Prescale</description>
              <bitRange>[7:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TAR</name>
          <description>GPTM Timer A</description>
          <addressOffset>0x00000048</addressOffset>
          <fields>
            <field>
              <name>TIMER_TAR_TARL</name>
              <description>GPTM Timer A Register Low</description>
              <bitRange>[15:0]</bitRange>
            </field>
            <field>
              <name>TIMER_TAR_TARH</name>
              <description>GPTM Timer A Register High</description>
              <bitRange>[31:16]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TBR</name>
          <description>GPTM Timer B</description>
          <addressOffset>0x0000004C</addressOffset>
          <fields>
            <field>
              <name>TIMER_TBR_TBRL</name>
              <description>GPTM Timer B</description>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
